Ai-Thinker-Open/Ai-Thinker-Open_ESP32-CAMERA_LAN/examples/single_chip/camera_web_server/main/app_httpd.c
static int8_t save_face_id_to_flash_name(face_id_name_list *id_list,char * name )
{
    if(0==l->count){
        ESP_LOGE(TAG, "list is empty");
        return -3;
    }
    // left_sample == 0
    const esp_partition_t *pt = esp_partition_find_first(FR_FLASH_TYPE, FR_FLASH_SUBTYPE, FR_FLASH_PARTITION_NAME);
    if (pt == NULL){
        ESP_LOGE(TAG, "Not found");
        return -2;
    }

    uint8_t enroll_id_idx = l->count - 1;

    // flash can only be erased divided by 4K
    const int block_len = FACE_ID_SIZE * sizeof(float);
    const int block_num = (4096 + block_len - 1) / block_len;

    if(enroll_id_idx % block_num == 0)
    {
        // save the other block TODO: if block != 2
        esp_partition_erase_range(pt, 4096 + enroll_id_idx * block_len, 4096);

        esp_partition_write(pt, 4096 + enroll_id_idx * block_len, l->tail->id_vec->item, block_len);
    }
    else
    {
        // save the other block TODO: if block != 2
        float *backup_buf = (float *)dl_lib_calloc(1, block_len, 0);
        esp_partition_read(pt, 4096 + (enroll_id_idx - 1) * block_len, backup_buf, block_len);

        esp_partition_erase_range(pt, 4096 + (enroll_id_idx - 1) * block_len, 4096);

        esp_partition_write(pt, 4096 + (enroll_id_idx - 1) * block_len, backup_buf, block_len);
        esp_partition_write(pt, 4096 + enroll_id_idx * block_len, l->tail->id_vec->item, block_len); 
        dl_lib_free(backup_buf);
    }

    const int name_len = ENROLL_NAME_LEN * sizeof(char);
    char *backup_name = (char *)dl_lib_calloc(l->count, name_len, 0);
    esp_partition_read(pt, sizeof(int) + sizeof(uint8_t), backup_name, name_len * (l->count - 1));
    memcpy(backup_name + (l->count - 1) * name_len, l->tail->id_name, name_len);
    esp_partition_erase_range(pt, 0, 4096);
    int flash_info_flag = FR_FLASH_INFO_FLAG;
    esp_partition_write(pt, 0, &flash_info_flag, sizeof(int));
    esp_partition_write(pt, sizeof(int), &l->count, sizeof(uint8_t));
    esp_partition_write(pt, sizeof(int) + sizeof(uint8_t), backup_name, name_len * l->count);
    dl_lib_free(backup_name);

    return 0;
    }
static int8_t save_face_id_to_flash(face_id_name_list *id_list)
{
        if(0==id_list->count){
            ESP_LOGE(TAG, "list is empty");
            return -3;
        }
        const esp_partition_t *pt = esp_partition_find_first(FR_FLASH_TYPE, FR_FLASH_SUBTYPE, FR_FLASH_PARTITION_NAME);
        if (pt == NULL){
            ESP_LOGE(TAG, "Not found");
        return -2;
        }

            const int block_len = FACE_ID_SIZE * sizeof(float);
            const int block_num = (4096 + block_len - 1) / block_len;
            float *backup_buf = (float *)dl_lib_calloc(1, block_len, 0);
            int flash_info_flag = FR_FLASH_INFO_FLAG;
            uint8_t enroll_id_idx = id_list->tail == 0 ? (id_list->size - 1) : (id_list->tail - 1) % id_list->size;

            if(enroll_id_idx % block_num == 0)
            {
                // save the other block TODO: if block != 2
                esp_partition_read(pt, 4096 + (enroll_id_idx + 1) * block_len, backup_buf, block_len);

                esp_partition_erase_range(pt, 4096 + enroll_id_idx * block_len, 4096);

                esp_partition_write(pt, 4096 + enroll_id_idx * block_len, id_list->id_list[enroll_id_idx]->item, block_len);
                esp_partition_write(pt, 4096 + (enroll_id_idx + 1) * block_len, backup_buf, block_len); 
            }
            else
            {
                // save the other block TODO: if block != 2
                esp_partition_read(pt, 4096 + (enroll_id_idx - 1) * block_len, backup_buf, block_len);

                esp_partition_erase_range(pt, 4096 + (enroll_id_idx - 1) * block_len, 4096);

                esp_partition_write(pt, 4096 + (enroll_id_idx - 1) * block_len, backup_buf, block_len);
                esp_partition_write(pt, 4096 + enroll_id_idx * block_len, id_list->id_list[enroll_id_idx]->item, block_len); 
            }
            dl_lib_free(backup_buf);

            esp_partition_erase_range(pt, 0, 4096);
            esp_partition_write(pt, 0, &flash_info_flag, sizeof(int));
            esp_partition_write(pt, sizeof(int), id_list, sizeof(face_id_name_list));
        return 0;
}
int8_t e_save_face_id_to_flash(void)
{
        if(0)
            return save_face_id_to_flash_name(&id_list,NULL);
        else        
            return save_face_id_to_flash(&id_list);
}

int8_t e_delete_face_id_in_flash(void)
{
        return delete_face_id_in_flash(&id_list);
}
int8_t e_read_face_id_from_flash(uint8_t sv_id_num,uint8_t cf_times)
{
	uint8_t sv_id_num_t=sv_id_num&0x0f;
	uint8_t cf_times_t=cf_times&0xff;
	
	while(delete_face(&id_list));
	face_id_init(&id_list, sv_id_num_t, cf_times_t);

    	return read_face_id_from_flash(&id_list);
}
#endif
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static int run_face_recognition(dl_matrix3du_t *image_matrix, box_array_t *net_boxes)
{
    dl_matrix3du_t *aligned_face = NULL;
    int matched_id = 0;

    aligned_face = dl_matrix3du_alloc(1, FACE_WIDTH, FACE_HEIGHT, 3);
    if (!aligned_face)
    {
        ESP_LOGE(TAG, "Could not allocate face recognition buffer");
        return matched_id;
    }
    if (align_face(net_boxes, image_matrix, aligned_face) == ESP_OK)
    {
        if (is_enrolling == 1)
        {
            int8_t left_sample_face;

            left_sample_face = enroll_face(&id_list, aligned_face);

            if (left_sample_face == (ENROLL_CONFIRM_TIMES - 1))
            {
                ESP_LOGI(TAG, "Enrolling Face ID: %d", id_list.tail);// 2
            }
            ESP_LOGI(TAG, "Enrolling Face ID: %d sample %d", id_list.tail, ENROLL_CONFIRM_TIMES - left_sample_face);
            rgb_printf(image_matrix, FACE_COLOR_CYAN, "ID[%u] Sample[%u]", id_list.tail, ENROLL_CONFIRM_TIMES - left_sample_face);
            if (left_sample_face == 0)
            {
                is_enrolling = 0;
                ESP_LOGI(TAG, "Enrolled Face ID: %d", id_list.tail);
            }
        }
        else
        {
            matched_id = recognize_face(&id_list, aligned_face);
            if (matched_id >= 0)
            {
                ESP_LOGW(TAG, "Match Face ID: %u", matched_id);
                rgb_printf(image_matrix, FACE_COLOR_GREEN, "Hello Subject %u", matched_id);
            }
            else
            {
                ESP_LOGW(TAG, "No Match Found");
                rgb_print(image_matrix, FACE_COLOR_RED, "Intruder Alert!");
                matched_id = -1;
            }
        }
    }
    else
    {
        ESP_LOGW(TAG, "Face Not Aligned");
        //rgb_print(image_matrix, FACE_COLOR_YELLOW, "Human Detected");
    }

    dl_matrix3du_free(aligned_face);
    return matched_id;
}
#endif
#endif

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en)
{ // Turn LED On or Off
    int duty = en ? led_duty : 0;
    if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
    {
        duty = CONFIG_LED_MAX_INTENSITY;
    }
    ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
    ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
    ESP_LOGI(TAG, "Set LED intensity to %d", duty);
}
#endif

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
    int64_t fr_start = esp_timer_get_time();

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
    enable_led(true);
    vTaskDelay(150 / portTICK_PERIOD_MS); // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
    fb = esp_camera_fb_get();             // or it won't be visible in the frame. A better way to do this is needed.
    enable_led(false);
#else
    fb = esp_camera_fb_get();
#endif

    if (!fb)
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

